Section_4_Real_Workload_Validation/Experiment13/data/raw/case-B/sustained-ramp/trial_019/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 28.908ms, rate sampling interval: 98ms
  Thread calibration: mean lat.: 21.634ms, rate sampling interval: 81ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.30ms   25.16ms 526.34ms   93.52%
    Req/Sec   301.39     84.51     1.28k    81.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.26ms
 75.000%   28.77ms
 90.000%   43.81ms
 99.000%  101.69ms
 99.900%  387.84ms
 99.990%  519.93ms
 99.999%  526.85ms
100.000%  526.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.167     0.000000            1         1.00
      14.063     0.100000        10201         1.11
      15.511     0.200000        20411         1.25
      16.671     0.300000        30670         1.43
      17.823     0.400000        40885         1.67
      19.263     0.500000        50983         2.00
      20.287     0.550000        56134         2.22
      21.615     0.600000        61195         2.50
      23.407     0.650000        66297         2.86
      25.823     0.700000        71391         3.33
      28.767     0.750000        76474         4.00
      30.591     0.775000        79021         4.44
      32.447     0.800000        81564         5.00
      34.655     0.825000        84137         5.71
      37.023     0.850000        86685         6.67
      40.127     0.875000        89208         8.00
      41.887     0.887500        90482         8.89
      43.807     0.900000        91753        10.00
      46.399     0.912500        93031        11.43
      48.895     0.925000        94308        13.33
      52.223     0.937500        95575        16.00
      54.175     0.943750        96212        17.78
      56.415     0.950000        96847        20.00
      59.039     0.956250        97486        22.86
      62.079     0.962500        98125        26.67
      66.303     0.968750        98767        32.00
      68.991     0.971875        99077        35.56
      71.679     0.975000        99399        40.00
      75.263     0.978125        99717        45.71
      78.975     0.981250       100033        53.33
      83.327     0.984375       100354        64.00
      86.783     0.985938       100511        71.11
      91.391     0.987500       100673        80.00
      97.279     0.989062       100829        91.43
     104.511     0.990625       100989       106.67
     114.175     0.992188       101148       128.00
     129.343     0.992969       101228       142.22
     138.495     0.993750       101307       160.00
     152.191     0.994531       101387       182.86
     173.695     0.995313       101467       213.33
     187.007     0.996094       101546       256.00
     198.015     0.996484       101586       284.44
     219.263     0.996875       101626       320.00
     236.671     0.997266       101666       365.71
     253.951     0.997656       101706       426.67
     288.767     0.998047       101745       512.00
     310.783     0.998242       101765       568.89
     318.719     0.998437       101785       640.00
     360.191     0.998633       101805       731.43
     382.463     0.998828       101825       853.33
     391.679     0.999023       101846      1024.00
     425.471     0.999121       101855      1137.78
     444.671     0.999219       101866      1280.00
     446.207     0.999316       101877      1462.86
     452.095     0.999414       101886      1706.67
     460.287     0.999512       101895      2048.00
     466.431     0.999561       101900      2275.56
     487.423     0.999609       101905      2560.00
     499.711     0.999658       101910      2925.71
     504.831     0.999707       101916      3413.33
     510.463     0.999756       101920      4096.00
     514.559     0.999780       101923      4551.11
     515.327     0.999805       101928      5120.00
     515.327     0.999829       101928      5851.43
     515.583     0.999854       101931      6826.67
     515.839     0.999878       101932      8192.00
     518.399     0.999890       101933      9102.22
     520.447     0.999902       101935     10240.00
     520.703     0.999915       101936     11702.86
     524.031     0.999927       101937     13653.33
     525.823     0.999939       101938     16384.00
     526.335     0.999945       101941     18204.44
     526.335     0.999951       101941     20480.00
     526.335     0.999957       101941     23405.71
     526.335     0.999963       101941     27306.67
     526.335     0.999969       101941     32768.00
     526.847     0.999973       101944     36408.89
     526.847     1.000000       101944          inf
#[Mean    =       26.304, StdDeviation   =       25.159]
#[Max     =      526.336, Total count    =       101944]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  107693 requests in 3.00m, 87.61MB read
Requests/sec:    598.24
Transfer/sec:    498.34KB